       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TinyProgram.

       PROCEDURE DIVISION.
       DisplayGreeting.
           DISPLAY "Hello, world!".
           STOP RUN.
